# Use with `brew bundle`

tap 'mas-cli/tap'

brew "bash-completion"
brew "ccache"
brew "clang-format"
brew "cmake"
brew "docker"
brew "docker-compose"
brew "git"
brew "llvm"
brew "mas"
brew "ninja"
brew "node"
brew "ollama"
brew "opencode"
brew "php"
brew "python@3.14"
brew "tig"
brew "vim"
brew "wget"

cask "firefox"
cask "gimp"
cask "google-chrome"
cask "inkscape"
cask "keepassxc"
#cask "microsoft-office"
cask "microsoft-teams"
cask "spotify"
cask "steam"
cask "tunnelblick"
cask "visual-studio-code"
cask "zed"

mas "AdBlock", id: 1402042596
mas "Userscripts", id: 1463298887
#mas 'Xcode', id: 497799835
