# Update outdated macOS tools
brew "bash"
brew "bash-completion2"
brew "coreutils"
brew "grep"
brew "openssh"
brew "php"
brew "screen"
brew "vim"
brew "wget"

# Support Mac AppStore in brew
tap "mas-cli/tap"
brew "mas"

# Enable autoupdates for brew
tap "domt4/autoupdate"
brew "pinentry-mac"

# Fonts
cask "font-fira-code-nerd-font"

# Security tools
brew "gnupg"
cask "tunnelblick"

# Foundation
cask "keepassxc"
brew "stats"

# Necessary office tools
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "microsoft-teams"
cask "spotify"

# Dev tools
brew "git"
brew "tig"
brew "docker"
brew "docker-compose"
cask "visual-studio-code"
cask "zed"
#mas 'Xcode', id: 497799835

## C++
brew "ccache"
brew "clang-format"
brew "cmake"
brew "llvm"
brew "ninja"

## Gen AI
brew "ollama", restart_service: :changed
brew "opencode"

# Browser
cask "firefox"
cask "google-chrome"
mas "AdBlock", id: 1402042596
mas "Userscripts", id: 1463298887

# Graphic tools
cask "gimp"
cask "inkscape"

# Private
cask "steam"
